УТ_для_edt/src/InformationRegisters/CRM_ДанныеОбратнойСвязи/CRM_ДанныеОбратнойСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ДанныеОбратнойСвязи</name>
  <resources>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </resources>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/CommonModules/CRM_РаботаСОбращениями/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает интервал времени строкой.
//
// Параметры:
//	ВремяОкончания - Дата - Время окончания.
//	ВремяНачала	   - Дата - Время начала.
//
// Возвращаемое значение:
//	Строка - интервал времени строкой.
//
Функция ИнтервалВремениСтрокой(ВремяОкончания, ВремяНачала = Неопределено) Экспорт
	
	Если ВремяНачала = Неопределено Тогда
		ВремяНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗнакИнтервала = "";
	ВеличинаИнтервала = ВремяОкончания - ВремяНачала;
	Если ВеличинаИнтервала < 0 Тогда
		ВеличинаИнтервала = -ВеличинаИнтервала;
		ЗнакИнтервала = "-";
	КонецЕсли;
	
	ВеличинаИнтервалаВДнях = Цел(ВеличинаИнтервала/60/60/24);
	ОстатокЧасовМинут = ВеличинаИнтервала - ВеличинаИнтервалаВДнях*60*60*24;
	ВеличинаИнтервалаВЧасах = Цел(ОстатокЧасовМинут/60/60);
	ОстатокМинут = ОстатокЧасовМинут - ВеличинаИнтервалаВЧасах*60*60;
	ВеличинаИнтервалаВМинутах = Цел(ОстатокМинут/60);
	
	ОписаниеИнтервала = ЗнакИнтервала +
		?(ВеличинаИнтервалаВДнях = 0, "", Строка(ВеличинаИнтервалаВДнях) + НСтр("ru = 'д'; en = 'd'") + " ") +
		?(ВеличинаИнтервалаВЧасах = 0, "", Строка(ВеличинаИнтервалаВЧасах) + НСтр("ru = 'ч'; en = 'h'") + " ") +
		?(ВеличинаИнтервалаВМинутах = 0, "", Строка(ВеличинаИнтервалаВМинутах) + НСтр("ru = 'мин'; en = 'min'"));
	
	Возврат ОписаниеИнтервала;
	
КонецФункции

// Возвращает ключ обратной связи по обращению.
//
// Параметры:
//	Обращение - ДокументСсылка.CRM_Интерес - Обращение для установки обратной связи.
//
// Возвращаемое значение:
//	Строка - ключ обратной связи по обращению.
//
Функция КлючОбратнойСвязиПоОбращению(Обращение) Экспорт
	
	Ключ = СтрЗаменить(Обращение.УникальныйИдентификатор(), "-", "");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеОбратнойСвязи.Ключ КАК Ключ
	|ИЗ
	|	РегистрСведений.CRM_ДанныеОбратнойСвязи КАК ДанныеОбратнойСвязи
	|ГДЕ
	|	ДанныеОбратнойСвязи.Ключ = &Ключ");
	
	Запрос.Параметры.Вставить("Ключ", Ключ);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		МенеджерЗаписи = РегистрыСведений.CRM_ДанныеОбратнойСвязи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ключ = Ключ;
		МенеджерЗаписи.Обращение = Обращение;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ключ;
	
КонецФункции

// Возвращает адрес страницы обратной связи.
//
// Возвращаемое значение:
//	Строка - адрес страницы обратной связи.
//
Функция АдресСтраницыОбратнойСвязи() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	АдресПубликации = Константы.CRM_АдресСервисаОбратнойСвязи.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресПубликации);
	
	АдресОбратнойСвязи =  СтруктураАдреса.Схема + "://" +
		СтруктураАдреса.Хост +
		?(ЗначениеЗаполнено(СтруктураАдреса.Порт), ":" + ?(ТипЗНЧ(СтруктураАдреса.Порт) = Тип("Число"), Формат(СтруктураАдреса.Порт, "ЧГ="), СтруктураАдреса.Порт), "") + "/" +
		СтруктураАдреса.ПутьНаСервере;
		
	Возврат АдресОбратнойСвязи;
	
КонецФункции

#КонецОбласти
